<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release of Microsoft Skype Meetings App dmg and creates a new package containing the app bundle.</string>
    <key>Identifier</key>
    <string>com.github.jlehikoinen.pkg.SkypeMeetingsApp</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>SkypeMeetingsApp</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.1</string>
    <key>ParentRecipe</key>
    <string>com.github.jlehikoinen.download.SkypeMeetingsApp</string>
    <key>Process</key>
    <array>
        <dict>
			<key>Comment</key>
			<string>Get version number from app bundle</string>
			<key>Processor</key>
			<string>Versioner</string>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%pathname%/Skype Meetings App.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleVersion</string>
			</dict>
        </dict>
            <dict>
                <key>Processor</key>
                <string>AppPkgCreator</string>
                <key>Arguments</key>
                <dict>
                    <key>app_path</key>
                    <string>%pathname%/Skype Meetings App.app</string>
                </dict>
            </dict>
    </array>
</dict>
</plist>
