<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>
	Downloads the current releases of Nmap, Zenmap, Ncat and Ndiff.
    </string>
    <key>Identifier</key>
    <string>com.github.jlehikoinen.download.Nmap</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Nmap</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
    	<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>http://nmap.org/dist/</string>
				<key>re_pattern</key>
				<string>(nmap-[0-9]\.[0-9]+.dmg)</string>
				<key>result_output_var_name</key>
				<string>dmg</string>
			</dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
            	<key>url</key>
				<string>http://nmap.org/dist/%dmg%</string>
				<key>filename</key>
				<string>%NAME%.dmg</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
