<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release of Microsoft AutoUpdate package, creates a new package and imports the package into Jamf Pro server.</string>
    <key>Identifier</key>
    <string>com.github.jlehikoinen.jss.MicrosoftAutoUpdate</string>
    <key>Input</key>
    <dict>
        <key>CATEGORY</key>
        <string>Office</string>
        <key>GROUP_NAME</key>
        <string>%NAME%-update-smart</string>
        <key>GROUP_TEMPLATE</key>
        <string>%RECIPE_DIR%/MicrosoftAutoUpdateSmartGroupTemplate.xml</string>
        <key>NAME</key>
        <string>Microsoft AutoUpdate</string>
        <key>OS_REQUIREMENTS</key>
        <string>10.15.x,10.14.x,10.13.x,10.12.x,10.11.x,10.10.x</string>
        <key>POLICY_CATEGORY</key>
        <string>Testing</string>
        <key>POLICY_TEMPLATE</key>
        <string>%RECIPE_DIR%/PolicyTemplate.xml</string>
        <key>POLICY_TRIGGER</key>
        <string>Install_MicrosoftAutoUpdate</string>
        <key>SELF_SERVICE_DESCRIPTION</key>
        <string>Install the latest version of Microsoft AutoUpdate</string>
        <key>SELF_SERVICE_ICON</key>
        <string>Microsoft AutoUpdate.png</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.1</string>
    <key>ParentRecipe</key>
    <string>com.github.jlehikoinen.download.MicrosoftAutoUpdate</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Comment</key>
                <string>First expand flat package</string>
                <key>Processor</key>
                <string>FlatPkgUnpacker</string>
                <key>Arguments</key>
                <dict>
                    <key>flat_pkg_path</key>
                    <string>%pathname%</string>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/pkg_unpack</string>
                    <key>purge_destination</key>
                    <false/>
                </dict>
            </dict>
            <dict>
                <key>Comment</key>
                <string>Unpack pkg based on pkg payload information</string>
                <key>Processor</key>
                <string>PkgPayloadUnpacker</string>
                <key>Arguments</key>
                <dict>
                    <key>pkg_payload_path</key>
                    <string>%RECIPE_CACHE_DIR%/pkg_unpack/Office16_autoupdate_updater.pkg/Payload</string>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/pkgroot/Library/Application Support/Microsoft/MAU2.0/</string>
                    <key>purge_destination</key>
                    <false/>
                </dict>
            </dict>
            <dict>
                <key>Comment</key>
                <string>Get Microsoft AutoUpdate version from the extracted payload</string>
                <key>Processor</key>
                <string>Versioner</string>
                <key>Arguments</key>
                <dict>
                    <key>input_plist_path</key>
                    <string>%RECIPE_CACHE_DIR%/pkgroot/Library/Application Support/Microsoft/MAU2.0/Microsoft AutoUpdate.app/Contents/Info.plist</string>
                    <key>plist_version_key</key>
                    <string>CFBundleVersion</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>PkgCreator</string>
                <key>Arguments</key>
                <dict>
                    <key>pkg_request</key>
                    <dict>
                        <key>pkgroot</key>
                        <string>%RECIPE_CACHE_DIR%/pkgroot</string>
                        <key>pkgname</key>
                        <string>%SOFTWARETITLE%-%version%</string>
                        <key>pkgtype</key>
                        <string>flat</string>
                        <key>id</key>
                        <string>com.microsoft.autoupdate2</string>
                        <key>version</key>
                        <string>%version%</string>
                     </dict>
                </dict>
            </dict>
            <dict>
                <key>Comment</key>
                <string>Delete temp directories</string>
                <key>Arguments</key>
                <dict>
                    <key>path_list</key>
                    <array>
                        <string>%RECIPE_CACHE_DIR%/pkg_unpack</string>
                        <string>%RECIPE_CACHE_DIR%/pkgroot</string>
                    </array>
                </dict>
                <key>Processor</key>
                <string>PathDeleter</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>os_requirements</key>
                    <string>%OS_REQUIREMENTS%</string>
                    <key>prod_name</key>
                    <string>%NAME%</string>
                    <key>category</key>
                    <string>%CATEGORY%</string>
                    <key>pkg_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
                    <key>policy_category</key>
                    <string>%POLICY_CATEGORY%</string>
                    <key>policy_template</key>
                    <string>%POLICY_TEMPLATE%</string>
                    <key>self_service_icon</key>
                    <string>%SELF_SERVICE_ICON%</string>
                    <key>self_service_description</key>
                    <string>%SELF_SERVICE_DESCRIPTION%</string>
                    <key>extension_attributes</key>
                    <array>
                        <dict>
                            <key>ext_attribute_path</key>
                            <string>MicrosoftAutoUpdateExtensionAttribute.xml</string>
                        </dict>
                    </array>
                    <key>groups</key>
                    <array>
                        <dict>
                            <key>name</key>
                            <string>%GROUP_NAME%</string>
                            <key>smart</key>
                            <true/>
                            <key>template_path</key>
                            <string>%GROUP_TEMPLATE%</string>
                        </dict>
                    </array>
                </dict>
                <key>Processor</key>
                <string>JSSImporter</string>
            </dict>
        </array>
    </dict>
</plist>
