<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release of Microsoft AutoUpdate package, creates a new package and imports the package into Jamf Pro server.</string>
	<key>Identifier</key>
	<string>com.github.jlehikoinen.jss.MicrosoftAutoUpdate</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Office</string>
		<key>GROUP_NAME</key>
		<string>%NAME%-update-smart</string>
		<key>GROUP_TEMPLATE</key>
		<string>%RECIPE_DIR%/SmartGroupTemplate.xml</string>
		<key>NAME</key>
		<string>Microsoft AutoUpdate</string>
		<key>OS_REQUIREMENTS</key>
		<string>10.14.x,10.13.x,10.12.x,10.11.x,10.10.x</string>
		<key>POLICY_CATEGORY</key>
		<string>Testing</string>
		<key>POLICY_TEMPLATE</key>
		<string>%RECIPE_DIR%/PolicyTemplate.xml</string>
		<key>POLICY_TRIGGER</key>
		<string>Install_MicrosoftAutoUpdate</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>Install the latest version of Microsoft AutoUpdate</string>
		<key>SELF_SERVICE_ICON</key>
		<string>Microsoft AutoUpdate.png</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.download.MSAutoUpdate</string>
	<key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>os_requirements</key>
                    <string>%OS_REQUIREMENTS%</string>
                    <key>prod_name</key>
                    <string>%NAME%</string>
                    <key>category</key>
                    <string>%CATEGORY%</string>
                    <key>pkg_path</key>
                    <string>%RECIPE_CACHE_DIR%/downloads/%NAME%-%version%.pkg</string>
                    <key>policy_category</key>
                    <string>%POLICY_CATEGORY%</string>
                    <key>policy_template</key>
                    <string>%POLICY_TEMPLATE%</string>
                    <key>self_service_icon</key>
                    <string>%SELF_SERVICE_ICON%</string>
                    <key>self_service_description</key>
                    <string>%SELF_SERVICE_DESCRIPTION%</string>
                    <key>groups</key>
                    <array>
                        <dict>
                            <key>name</key>
                            <string>%GROUP_NAME%</string>
                            <key>smart</key>
                            <true/>
                            <key>template_path</key>
                            <string>%GROUP_TEMPLATE%</string>
                        </dict>
                    </array>
                </dict>
                <key>Processor</key>
                <string>JSSImporter</string>
            </dict>
        </array>
    </dict>
</plist>
