<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release of Microsoft Skype for Business Web App.</string>
    <key>Identifier</key>
    <string>com.github.jlehikoinen.download.SkypeForBusinessWebApp</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>SkypeForBusinessWebApp</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>DeprecationWarning</string>
            <key>Arguments</key>
            <dict>
                <key>warning_message</key>
                <string>Consider switching to the MicrosoftSkypeForBusiness365 recipes in the rtrouton-recipes repo. This recipe is deprecated and will be removed in the future.</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://sb224.sbweb.microsoft.com//lwa/Plugins/SkypeForBusinessPlugin.pkg</string>
                <key>filename</key>
                <string>%NAME%.pkg</string>
            </dict>
            <key>Comment</key>
            <string>Company specific URL, Microsoft used in this recipe.</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%</string>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: Microsoft Corporation (UBF8T346G9)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
            </dict>
        </dict>
    </array>
</dict>
</plist>
