<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Mattermost and creates a new installer package.</string>
    <key>Identifier</key>
    <string>com.github.jlehikoinen.pkg.Mattermost</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Mattermost</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>ParentRecipe</key>
    <string>com.github.peshay.download.Mattermost</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Mattermost.app</string>
                <key>requirement</key>
                <string>identifier "Mattermost.Desktop" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = UQ8HT4Q2XM</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>AppPkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>app_path</key>
                <string>%pathname%/Mattermost.app</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
