<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest version of Mattermost, creates a new installer package and imports the package into Jamf Pro server.</string>
        <key>Identifier</key>
        <string>com.github.jlehikoinen.jss.Mattermost</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Mattermost</string>
            <key>CATEGORY</key>
            <string>Business</string>
            <key>OS_REQUIREMENTS</key>
            <string>10.15.x,10.14.x,10.13.x,10.12.x,10.11.x,10.10.x</string>
            <key>POLICY_CATEGORY</key>
            <string>Testing</string>
            <key>POLICY_TEMPLATE</key>
            <string>%RECIPE_DIR%/PolicyTemplate.xml</string>
            <key>SELF_SERVICE_ICON</key>
            <string>%RECIPE_DIR%/Mattermost.png</string>
            <key>GROUP_TEMPLATE</key>
            <string>%RECIPE_DIR%/SmartGroupTemplate.xml</string>
            <key>GROUP_NAME</key>
            <string>%NAME%-update-smart</string>
            <key>SELF_SERVICE_DESCRIPTION</key>
            <string>Mattermost: Open Source, Private Cloud Slack Alternative</string>
        </dict>
        <key>MinimumVersion</key>
        <string>1.0.0</string>
        <key>ParentRecipe</key>
        <string>com.github.jlehikoinen.pkg.Mattermost</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>com.github.grahampugh.recipes.commonprocessors/VersionRegexGenerator</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>os_requirements</key>
                    <string>%OS_REQUIREMENTS%</string>
                    <key>prod_name</key>
                    <string>%NAME%</string>
                    <key>category</key>
                    <string>%CATEGORY%</string>
                    <key>policy_category</key>
                    <string>%POLICY_CATEGORY%</string>
                    <key>policy_template</key>
                    <string>%POLICY_TEMPLATE%</string>
                    <key>self_service_icon</key>
                    <string>%SELF_SERVICE_ICON%</string>
                    <key>self_service_description</key>
                    <string>%SELF_SERVICE_DESCRIPTION%</string>
                    <key>groups</key>
                    <array>
                        <dict>
                            <key>name</key>
                            <string>%GROUP_NAME%</string>
                            <key>smart</key>
                            <true/>
                            <key>template_path</key>
                            <string>%GROUP_TEMPLATE%</string>
                        </dict>
                    </array>
                </dict>
                <key>Processor</key>
                <string>JSSImporter</string>
            </dict>
        </array>
    </dict>
</plist>
